In [20]:
import pandas as pd
#Dictionary
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}

In [21]:
df = pd.DataFrame(data)

In [6]:
#understanding the shape of dataframe as (rows,columns)
df.shape

(5, 3)

In [7]:
#showing head
df.head(2)

    name  reports  year
0  Jason        4  2012
1  Molly       24  2012

In [9]:
#Describing a dataset - numerical values
df.describe()

         reports    year
count   5.000000     5.0
mean   12.800000  2013.0
std    13.663821     1.0
min     2.000000  2012.0
25%     3.000000  2012.0
50%     4.000000  2013.0
75%    24.000000  2014.0
max    31.000000  2014.0

In [10]:
#select from row 3
df[2:]

   name  reports  year
2  Tina       31  2013
3  Jake        2  2014
4   Amy        3  2014

In [11]:
len(df)

5

In [12]:
#select last 2 rows
df[-2:]

   name  reports  year
3  Jake        2  2014
4   Amy        3  2014

In [13]:
#get the list of columns
df.columns

Index(['name', 'reports', 'year'], dtype='object')

In [22]:
#get the years
df['year']

0    2012
1    2012
2    2013
3    2014
4    2014
Name: year, dtype: int64

In [23]:
#Get MAX of a year
df['year'].max()

2014

In [24]:
#Select a column based on value - just an intro
df[df['year']== 2014]

   name  reports  year
3  Jake        2  2014
4   Amy        3  2014